//дефолтні значення параметрів функції
//написати функцію greet(name), яка при визові отримує ім'я
//і логую строку "Привіт [ім'я]" якщо при виклику функції аргумент
//не буде записано в параметр потрібно вивести "Привіт [гість]"

const greet = function (name = 'гість') {//тут вказується дефолтне значеня яке у випадку, якщо не буде передано аргумента у функцію буде використовуватися дефолтне значення
  const greeting = `Привіт ${name}!`

  return greeting
}

console.log(greet('Хабібі'))
console.log(greet())