//псевдомасив arguments і Array

//arguments - це встроєнна змінна в кожній функції
//може знадобитися коли потрібно створити функцію, але ще не відомо скільки аргументів має бути записано в параметри функції

// const fn = function () { ////////СТАРИЙ СИНТАКСИС ДЕ ВИКОРИСТОВУВАВСЯ Array.from(), для отримання справжнього масиву
//     // console.log(arguments) //получиться псевдомасив з обмеженою к-стю методів для використання

//     const args = Array.from(arguments) //за допомогою глобального типу (конструктура) Array і за допомогою методу .from() перетворюємо псевдомасив в масив
//     console.log(args)
// }

///////НОВИЙ СИНТАКСИС використовується операціє REST////////////

const fn = function (...args) { //використовується операціє REST
    console.log(args) //що стосується rest, він завжди ставиться в кінці, а перед ним можна вказати інші параметри куди будуть присвоєні аргументи, все що не поміститься запишиться в ...rest
}

fn(1, 2, 3)
fn(1, 2, 3, 4, 5)
fn(1, 2, 3, 4, 5, 6, 7, 8)
